In [1]:
import pandas as pd

In [4]:
df = pd.read_csv('../data/USA_cars_datasets.csv')
df.head()

,Unnamed: 0,price,brand,model,year,title_status,mileage,color,vin,lot,state,country,condition
0,0,6300,toyota,cruiser,2008,clean vehicle,274117.0,black,jtezu11f88k007763,159348797,new jersey,usa,10 days left
1,1,2899,ford,se,2011,clean vehicle,190552.0,silver,2fmdk3gc4bbb02217,166951262,tennessee,usa,6 days left
2,2,5350,dodge,mpv,2018,clean vehicle,39590.0,silver,3c4pdcgg5jt346413,167655728,georgia,usa,2 days left
3,3,25000,ford,door,2014,clean vehicle,64146.0,blue,1ftfw1et4efc23745,167753855,virginia,usa,22 hours left
4,4,27700,chevrolet,1500,2018,clean vehicle,6654.0,red,3gcpcrec2jg473991,167763266,florida,usa,22 hours left

In [12]:
# use crosstab to see frequency between two features
pd.crosstab(df.brand, df.country, margins = True).head()

country    canada   usa  All
brand
acura           0     3    3
audi            0     4    4
bmw             0    17   17
buick           0    13   13
cadillac        0    10   10

In [14]:
# can also do for multiple 
pd.crosstab([df.brand, df.model], df.country, margins = True)

country             canada   usa   All
brand     model
acura     door           0     2     2
          mdx            0     1     1
audi      5              0     1     1
          door           0     2     2
          q5             0     1     1
...                    ...   ...   ...
nissan    xterra         0     1     1
peterbilt truck          0     4     4
ram       door           0     1     1
toyota    cruiser        0     1     1
All                      7  2492  2499

[181 rows x 3 columns]